src/InformationRegisters/ГП_УслугиБП77.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ГП_УслугиБП77</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>МетодРасчетаХВ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МетодРасчетаГВ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МетодРасчетаКан</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТолькоДляКанализации</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПроцентХВ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПроцентГВ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НаПодогрев</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НеНачислять</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЭтоПлатаЗаХолодноеВодоснабжениеОИ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЭтоНегативноеВоздействиеЦСВ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ОбъектАбонентаНаименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>КонтрагентКод</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>8</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектАбонентаКод</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>4</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЛицевойСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КВП_ЛицевыеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/ГП_УслугиБП77/Ext/ManagerModule.bsl
// ++ Гарант+ Килипенко 01.08.2024 [F00226689] перенос объектов абонентов из БП77 ++
#Область ПрограммныйИнтерфейс

// Заполняет значения признака `ЭтоНегативноеВоздействиеЦСВ` для всех записей регистра.
//  Заполнение выполняется по данным наименования объекта абонента 
// Возвращаемое значение:
//  - Структура
//      * Успех - Булево
//      * КоличествоИзмененныхСтрок - Число
Функция ЗаполнитьПризнакНегативноеВоздействие() Экспорт
    РезультатФункции = Новый Структура("Успех, КоличествоИзмененныхСтрок", Истина, 0);

    НаборВсехЗаписейРегистра = РегистрыСведений.ГП_УслугиБП77.СоздатьНаборЗаписей();
    НаборВсехЗаписейРегистра.Прочитать();

    Для Каждого ТекущаяСтрока Из НаборВсехЗаписейРегистра Цикл
        ТекущееЗначениеЭтоНегативноеВоздействие = ТекущаяСтрока.ЭтоНегативноеВоздействиеЦСВ;
        ТекущаяСтрока.ЭтоНегативноеВоздействиеЦСВ =
            ГП_МиграцияПриборовУчета.ЭтоНаименованиеУслугиНегативногоВоздействия(
                ТекущаяСтрока.ОбъектАбонентаНаименование);

        Если ТекущееЗначениеЭтоНегативноеВоздействие <> ТекущаяСтрока.ЭтоНегативноеВоздействиеЦСВ Тогда
            РезультатФункции.КоличествоИзмененныхСтрок = РезультатФункции.КоличествоИзмененныхСтрок + 1;
        КонецЕсли;
    КонецЦикла;

    Попытка
        НаборВсехЗаписейРегистра.Записать();
    Исключение
        ЖурналРегистрации.ДобавитьСообщениеДляЖурналаРегистрации(
            "Ошибка при записи в регистр сведений ""Услуги БП 7.7"" при обновлении значений признака негативного воздействия.",
            УровеньЖурналаРегистрации.Ошибка, , ,
            ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));

        РезультатФункции.КоличествоЗаписанныхУслуг = 0;
        РезультатФункции.КоличествоСохраненныхСвязей = 0;
        РезультатФункции.СообщениеОбОшибке = ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
        РезультатФункции.Успех = Ложь;

        РезультатФункции.КоличествоИзмененныхСтрок = 0;
        РезультатФункции.Успех = Ложь;
    КонецПопытки;

    Возврат РезультатФункции;
КонецФункции

#КонецОбласти // ПрограммныйИнтерфейс
// -- Гарант+ Килипенко 01.08.2024 [F00226689] перенос объектов абонентов из БП77 --
